Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: If not checked, an horizontal scroll bar will appear, if necessary.
ru_ru: Иначе, при недостатке ширины, будет отображаться горизонтальная полоса прокрутки.

source: If not, a "u" will be prefixed to the username and a "h" will be prefixed to the hostname as appropriate.
ru_ru: Если это не выполняется, будет добавлена приставка: «u» к имени пользователя, «h» к имени ПК.

source: If not, it will be permanently deleted.
ru_ru: Иначе, файл будет удалён навсегда.

source: If not, the new open will be cancelled and the existing opened database, if any, will remain open.
ru_ru: В противном случае, открытие нового контейнера будет отменено, а предыдущий контейнер останется открытым.

source: If not, then an error message will appear describing the problem.
ru_ru: В противном случае, будет отображено сообщение об ошибке.

source: If not, you will need to click on the Notes field in order to view the text there.
ru_ru: В противном случае, для отображения нужно будет щёлкнуть по полю ввода заметок.

source: If not, you will need to enter the full path of these files.
ru_ru: В противном случае необходимо указать полные пути к файлам.

source: If one of these is not included when entering a value, all combinations of the Alt, Ctrl and Shift keys are tried in the order (Alt; Alt+Shift; Ctrl; Ctrl+Shift, Alt+Ctrl; Alt+Ctrl+Shift) to achieve a unique combination.
ru_ru: Если ни Alt, ни Ctrl не присутствуют в комбинации, для получения уникальной комбинации проверяются все комбинации модификаторов Ctrl, Alt и Shift (в порядке Alt; Alt+Shift; Ctrl; Ctrl+Shift, Alt+Ctrl; Alt+Ctrl+Shift).

source: If other characters are present, they will be replaced by the underscore ("_").
ru_ru: Любые другие символы будут заменены на подчёркивание.

source: If present, groups are separated by periods ('.').
ru_ru: Группы (если присутствуют) разделяются точками («.»).

source: If present, groups are separated by periods (‘.’).
ru_ru: Группы (если присутствуют) разделяются символом «.».

source: If previous versions of Password Safe have never been installed, or if the data has already been removed, then the checkbox and Apply button will not be displayed.
ru_ru: Если предыдущие версии Password Safe не использовались на данном компьютере, или, если данные из реестре были удалены ранее, флажок и кнопка Применить будут скрыты.

source: If required, tick that you want to put all separate lines in the Notes field onto one line and enter the character to be used as the delimiter.
ru_ru: Если требуется, укажите символ для разделения строк с заметками.

source: If saved to disk, you can view it again via the "View → Reports" menu.
ru_ru: После сохранения на диск отчёт становится доступен через пункт меню Вид→Отчёты.

source: If saved to disk, you can view it again via the View -> Reports menu.
ru_ru: После сохранения на диск отчёт становится доступен через пункт меню «Просмотр»→«Отчёты».

source: If such a file exists, then it is automatically imported and the filters it contains are ready for use.
ru_ru: Если такой файл существует, из него автоматически загружаются фильтры.

source: If the '<DefaultAutoTypeSequence>' field is present within a KeePass group is used as the default Password Safe AutoType field for entries within that group.
ru_ru: Если для группы KeePass задано значение <DefaultAutoTypeSequence>, то для элементов этой группы в Password Safe оно будет использоваться как значение автонабора по умолчанию.

source: If the '<DefaultAutoTypeSequence>' field is present within a KeePass group is used as the default Password Safe Autotype field for entries within that group.
ru_ru: Если для группы KeePass задано значение <DefaultAutoTypeSequence>, то для элементов этой группы в Password Safe оно используется как значение автонабора по умолчанию.

source: If the '<OverrideURL>' field is not empty, its value is inserted into the Notes field and prefixed by "OverrideURL:" and the URL field is prefixed by "[alt]".
ru_ru: Если значение <OverrideURL> не пусто, то оно помещается в заметки с префиксом «OverrideURL:», а к значению поля URL добавляется приставка «[alt]».

source: If the '<Tags>' field is not empty, its value is inserted into the Notes field and prefixed by "Tags:".
ru_ru: Если значение <Tags> не пусто, то оно помещается в заметки с префиксом «Tags:».

source: If the Put icon in System Tray option is enabled, you can right-click on the system tray icon to get to the most recently used entries directly, without going through the application's main screen.
ru_ru: Если установлен флажок Отображать значок в области уведомлений, вы можете щёлкнуть правой кнопкой мыши на значке и выбрать один из недавно использованных элементов без отображения главного окна программы.

source: If the control key is pressed while clicking on a Dragbar icon, the relevant text is copied to the clipboard in addition to being pasted when the mouse button is released.
ru_ru: Если при захвате значка на панели «Dragbar» была нажата клавиша Сontrol, соответствующий текст дополнительно будет помещён в буфер обмена после отпускания.

source: If the control key is pressed while clicking on a dragbar icon, the relevant text is copied to the clipboard in addition to being pasted when the mouse button is released.
ru_ru: Если при щелчке на значке панели «Dragbar» нажата клавиша Сontrol, соответствующий текст дополнительно будет помещён в буфер обмена.

source: If the AutoType variable is present in the Run Command, AutoType will be performed once the target window is active.
ru_ru: Если в команде присутствует переменная автонабора, операция автонабора будет выполнена, как только окно приложения станет активным.

source: If the Find Toolbar was visible when this filter was activated, it will be closed, since no new Finds can be performed whilst this filter is active.
ru_ru: Пока данный фильтр активен, условие поиска не может быть изменено, поэтому при его активации скрывается панель поиска.

source: If the Notes field contains more than one line, it will include any embedded carraige return (CR) or line feed (LF).
ru_ru: Если поле заметок состоит из нескольких строк, значение переменной также будет содержать имеющиеся там символы возврата каретки (CR) и переноса строки (LF).

source: If the Notes field contains more than one line, it will include any embedded carriage return (CR) or line feed (LF).
ru_ru: Если поле заметок состоит из нескольких строк, значение переменной также будет содержать имеющиеся там символы возврата каретки (CR) и переноса строки (LF).

source: If the URL string begins with "\\" or "cmd://" (case insensitive) the field is placed in the Password Safe's entry's Run Command field and Placeholder substitution is performed (see below).
ru_ru: Если строка URL начинается с «\\» или «cmd://» (независимо от регистра), то значение помещается в поле «Выполнить», но перед этим производится подстановка ключевых последовательностей (см. ниже).

source: If the URL string begins with "\\" or "cmd://" (case insensitve) the field is placed in the Password Safe's entry's Run Command field and Placeholder substitution is performed (see below).
ru_ru: Если строка URL начинается с «\\» или «cmd://» (независимо от регистра), то значение помещается в поле «Выполнить», но перед этим производится подстановка ключевых последовательностей (см. ниже).

source: If the above deleted entry is reinstated, i.e. via Undo (Ctrl-Z), the entry will again be displayed.
ru_ru: Если элемент будет восстановлен с помощью операции отката (Ctrl+Z), он снова будет показан.

source: If the alias is then reverted back to a normal entry at a later date, this password history will again become active and be updated if its password is changed.
ru_ru: Если этот элемент будет преобразован в «обычный», история снова станет активной и будет обновляться при последующих сменах пароля.

source: If the base entry's title is "LDAP Server", and there are no other entries with that title, then an alias can be defined by an entry that has "[LDAP Server]" in the password field.
ru_ru: Если заголовок исходного элемента «Сервер» и никакой другой элемент не имеет такого заголовка, то элемент, вместо пароля которого указано «[Сервер]», будет являться его псевдонимом.

source: If the base entry's title is "LDAP Server", and there are no other entries with that title, then an alias will be defined by an entry that has "[LDAP Server]" in the password field.
ru_ru: Если заголовок исходного элемента «Сервер» и никакой другой элемент не имеет такого заголовка, то элемент, в поле пароль которого указано «[Сервер]», будет являться его псевдонимом.

source: If the configuration is successful, then the dialog box will close.
ru_ru: При успешном завершения окно будет закрыто.

source: If the current contents of the clipboard did not come from Password Safe, then this will have no effect.
ru_ru: Не оказывает действия, если содержимое буфера не принадлежит Password Safe.

source: If the current receiving database already has entries, then these preferences will be ignored.
ru_ru: Если в контейнере уже есть элементы, поля с настройками игнорируются.

source: If the database is in read-only mode, you may not add a new Named Password Policy, edit the database default policy or an existing Named Password Policy nor delete an unused Named Password Policy.
ru_ru: Если контейнер открыт в режиме «только чтение», добавление, удаление и редактирование политик создания паролей невозможно.

source: If the entry is a shortcut, then only its base entry will be exported.
ru_ru: Если это ярлык, то будет экспортирован только исходный элемент.

source: If the entry is an alias, the password of the exported entry will be that of its base entry.
ru_ru: Если это псевдоним, то в экспортируемый элемент будет подставлен пароль из исходного элемента.

source: If the entry is in both databases and have differences, then you can also do "Compare Entries", which will display all the fields and their contents indicating which are different.
ru_ru: Если различающийся элемент присутствует в обоих контейнерах, доступен пункт меню «Сравнить элементы...». При выборе данного пункта отображается список всех полей этих элементов с указанием отличающихся.

source: If the entry is protected, you will not be able to change any fields until you unprotect the entry via the Edit menu or right-click context menu.
ru_ru: Поля в защищённых элементах не могут быть изменены. Чтобы снять защиту с выберите в контекстном меню элемента (или в меню «Правка») «Снять защиту».

source: If the external editor supports it, it is possible to specify command line parameters to force a new instance for editing the Notes field to prevent this (for example: "-multiInst" for the Notepad++ editor).
ru_ru: Если поддерживается выбранным редактором, можно задать параметр командной строки для принудительного запуска нового экземпляра при редактировании заметок (например, «-multiInst» для редактора Notepad++).

source: If the list of entries is displayed, you can double click on an entry to edit/view it.
ru_ru: Чтобы отредактировать/просмотреть ссылающийся элемент, щёлкните по нему дважды.

source: If the padlock is closed, then the "OK" button is replaced with one labelled "Combination...".
ru_ru: Если замок закрыт, кнопка «ОК» заменяется на «Ввод пароля».

source: If the padlock is closed, then the window is displayed on a "Secure Desktop" on which the "Combination" (master passphrase) can be entered in a more secure manner.
ru_ru: Если замок закрыт, текущее окно отображено на «Защищённом рабочем столе», который обеспечивает дополнительную защиту при вводе мастер-пароля.

source: If the protocol is not specified, then "http://" is assumed (e.g., "www.foo.net" is the same as "http://www.foo.net").
ru_ru: Если протокол не указан, считается, что это HTTP-ссылка (т. е. «www.foo.net» эквивалентно «http://www.foo.net»).

source: If the same function is repeated and its report saved to disk, any existing report for this function will be overwritten.
ru_ru: При повторении действия и сохранении отчёта на диск, предыдущий отчёт для этого действия перезаписывается.

source: If the site requires an e-mail address as your login, it's much easier to set your email address in the Username field.
ru_ru: Если сайт требует указания адреса электронно почты в качестве логина, удобнее сохранить его в поле «Имя пользователя».

source: If the user specifies a warning interval e.g. 5 days before a password expires, the image shown changes to be half purple.
ru_ru: Если для таких элементов настроено предупреждение (например, за 5 дней до истечения), их значки станут наполовину пурпурными при наступлении срока предупреждения.

source: If there are "LDAP Server" entries in two different groups, say "Dept.
ru_ru: Если элемент «Сервер» присутствует в двух группах, например «Отдел

source: If there are other user/machine specific configurations in the file, they will be left untouched.
ru_ru: Если присутствуют настройки для других пользователей/компьютеров, они останутся в исходном файле.

source: If there aren't any entries with expiry date, this menu item will be grayed out.
ru_ru: Пункт меню неактивен, если отсутствуют элементы с заданными датами истечения пароля.

source: If there were more than one entry with this title, you would be warned that this is the case, and you would need to be more specific in order to uniquely identify the base entry by adding either its group, its user name, or both.
ru_ru: В случае, если несколько элементов имеют одинаковый заголовок, будет выведено предупреждение, и вам потребуется указать дополнительную информацию об исходном элементе (группу и/или имя пользователя).

source: If there were more than one entry with this title, you would be warned that this is the case, and you would need to be more specific to identify the base entry by adding either its group or its user name or both!
ru_ru: В случае, если несколько элементов имеют одинаковый заголовок, будет выведено предупреждение, и вам потребуется указать дополнительную информацию об исходном элементе (группу и/или имя пользователя)!

source: If they can be opened with the same passphrase as the currently open database, then their properties are also displayed.
ru_ru: Свойства контейнера отображаются в том случае, если к нему подходит введённый для текущего контейнера пароль.

source: If they have a different passphrase or are not a valid database, then a 'No' is displayed in the Passphrase column and no properties are displayed.
ru_ru: В случае, если пароль не подходит к этим контейнерам, в столбце «Пароль» отображается «Нет» и столбцы со свойствами не заполняются.

source: If this checkbox is cleared, Password Safe will move "behind" all displayed windows instead.
ru_ru: Если флажок снят, вместо сворачивания Password Safe будет перемещать своё окно на задний план.

source: If this field is blank, make sure your YubiKey is plugged in correctly.
ru_ru: Если поле пустое, убедитесь что устройство правильно подключено.

source: If this field is not empty, then the "Go" button is enabled.
ru_ru: Если поле заполнено, становится активной кнопка «Перейти».

source: If this field is not empty, then the "Send" button is enabled.
ru_ru: Если поле заполнено, становится активной кнопка «Отправить».

source: If this filter is active and you save your database changes, it will be cancelled and the full database will be displayed.
ru_ru: Если при активном фильтре сохранить контейнер, он будет снят и отобразятся все элементы.

source: If this is the first database opened on the startup of Password Safe, Password Safe will exit.
ru_ru: Если данный контейнер был открыт при запуске Password Safe, программа будет закрыта.

source: If this is the first database opened on the startup of PasswordSafe, PasswordSafe will exit.
ru_ru: Если данный контейнер был открыт при запуске Password Safe, программа будет закрыта.

source: If unchecked, the program will minimize to the task bar.
ru_ru: Если флажок снят, при сворачивании Password Safe будет оставаться панели задач.

source: If you wish to protect your database using your YubiKey only, then leave the "Safe Combination" and "Verify" fields empty, and click on the Yubikey button.
ru_ru: Если для защиты вы желаете использовать толькоYubiKey , тогда оставьте поля «Пароль» и «Подтверждение» пустыми, и щёлкните на кнопке с надписью YubiKey.

source: If you already have a YubiKey, note that Password Safe uses slot #2 for authentication, leaving slot #1 for other applications.
ru_ru: Для хранения своих данных Password Safe использует слот №␣2, оставляя 1-й слот свободным для использования в других приложениях.

source: If you are going to import a text file created with such a delimiter, then it must be specified, all the Notes lines will appear as one single line in the resulting database.
ru_ru: Использованный разделитель нужно будет указать при импорте, иначе текст заметок не будет разбит на строки.

source: If you are unable to choose, continue with the current database and use the database Compare function from the File menu to show the exact differences between the current and the Failsafe backup(s).
ru_ru: Если вы затрудняетесь в выборе, нажмите кнопку «Продолжить» и используйте пункт меню «Файл→Сравнить» для определения различий между текущим контейнером и аварийной резервной копией.

source: If you are using Password Safe for the first time, press the "New..." button.
ru_ru: Если вы используете Password Safe впервые, нажмите на кнопку «Новый...».

source: If you are using Password Safe for the first time, press the New Database button.
ru_ru: Если вы используете Password Safe впервые, нажмите кнопку «Новый контейнер».

source: If you change the Alias's password from [g:t:u] to some other value not in this format, it will change from an alias to a "normal" entry, and will have no relation to the previous base entry.
ru_ru: При изменении пароля псевдонима с [g:t:u] на какое-либо значение в другом формате, его тип изменится на «обычный», а связь с исходным элементом будет разорвана.

source: If you change the base's password, this is immediately reflected in all the alias entries associated with the base.
ru_ru: Изменение пароля исходного элемента немедленно отражается на связанных с ним псевдонимах.

source: If you change the password of an Alias (either via the Generate password button or by typing in the password field), the change will only be made when the Apply or OK button is clicked.
ru_ru: При изменении пароля для псевдонима (вручную, или с помощью кнопки «создать пароль»), правки будут применены только после нажатия на кнопку «Применить» или «OK».

source: If you change the password on January 7th, then the new expiration will be on January 12th (5 days after the password has been set).
ru_ru: Если изменить пароль 7 января, то он будет действовать до 12 января (в течение пяти дней со дня смены).

source: If you checked "Save database immediately after Edit or Add" in the Backup tab, entries will never be highlighted, because they get saved immediately.
ru_ru: Если на вкладке «Резервные копии» поставлен флажок «Сохранять контейнер после вставки или редактирования», элементы никогда не будут помечены, так как сохранение происходит немедленно.

source: If you choose "In N days", then you may specify a "Recurring" expiration.
ru_ru: В случае выбора «Через N дней» можно поставить флажок «Повторять».

source: If you clicked on Clear History by mistake, just click on Cancel instead of OK in the Edit/View Entry dialog box.
ru_ru: Если вы нажали кнопку «Очистить» по ошибке, нажмите «Отмена» для отклонения изменений.

source: If you close and exit Password Safe and then restart it, they will be reset to 'no restrictions' and the corresponding default fields for a search.
ru_ru: Если вы закроете Password Safe и перезапустите его, ограничения будут сняты, а списки полей будут иметь значения по умолчанию, характерные для поиска.

source: If you close and exit Password Safe and then restart it, they will be reset to 'no restrictions' and the corresponding default fields for these functions.
ru_ru: Если вы закроете Password Safe и перезапустите его, ограничения будут сняты, а списки полей будут иметь значения по умолчанию, характерные для данных функций.

source: If you close and exit Password Safe and then restart it, they will be reset to the corresponding default fields for these functions.
ru_ru: Если вы закроете Password Safe и перезапустите его, списки полей будут содержать значения по умолчанию, характерные для данных функций.

source: If you close and exit PasswordSafe and then restart it, they will be reset to 'no restrictions' and the corresponding default fields for a search.
ru_ru: Если вы закроете PasswordSafe и перезапустите его, ограничения будут сняты, а списки полей будут иметь значения по умолчанию, характерные для поиска.

source: If you close and exit PasswordSafe and then restart it, they will be reset to 'no restrictions' and the corresponding default fields for these functions.
ru_ru: Если вы закроете PasswordSafe и перезапустите его, ограничения будут сняты, а списки полей будут иметь значения по умолчанию, характерные для данных функций.

source: If you close and exit PasswordSafe and then restart it, they will be reset to the corresponding default fields for these functions.
ru_ru: Если вы закроете PasswordSafe и перезапустите его, списки полей будут содержать значения по умолчанию, характерные для данных функций.

source: If you currently have a password associated with this database, enter it in the Old Safe Combination field
ru_ru: Если для доступа к контейнеру также используется пароль, введите его в поле «Старый пароль».

source: If you decide to remove a shortcut or revert to the default shortcut for a given action, just select the desired 'Shortcut Key' field and right-click.
ru_ru: Для отмены указанного сочетания клавиш, или возврата к значению по умолчанию, щёлкните правой кнопкой мыши в поле «Комбинация...».

source: If you do not activate your YubiKey in the allotted time (about 15 seconds), then an error message will be displayed, and you can try again or cancel.
ru_ru: Если привязка не будет выполнена в течение отведённого времени (около 15-ти секунд), будет выведено сообщение об ошибке. После этого вы можете повторить попытку попытку или отменить действие.

source: If you do not have a YubiKey device, then the YubiKey-specific buttons and texts will not be displayed by Password Safe, and the YubiKey-specific instructions below do not apply.
ru_ru: Если у вас нет YubiKey, соответствующие кнопки не будут отображены в Password Safe, и вы можете пропустить описание их использования.

source: If you do open a Failsafe Backup and have decided that it is the version you wish to keep, you should save it as a normal database.
ru_ru: Если Вы открыли аварийную резервную копию, и решили, что эту версию нужно оставить, сохраните данный файл как обычный контейнер, используя пункт меню «Файл→Сохранить как».

source: If you do specify command line paramters, do not enclose them in quotes unless your chosen external editor requires them.
ru_ru: При указании параметров не заключайте значения в кавычки, если это не требуется для выбранного редактора.

source: If you do use these variables, the expanded path will be shown underneath once you navigate to a different control on this tab.
ru_ru: Раскрытый путь к каталогу будет указан под полем ввода при переключении на другое поле или вкладку.
